In [10]:
import pandas as pd
import numpy as np

In [11]:
# df = pd.read_csv('../TG_network_datasets/CanParl/CanParl.csv')
folder = 'wikipedia'
# df = pd.read_csv(f'./datasets/{folder}/{folder}.csv')
df = pd.read_csv(f'./datasets/{folder}/ml_{folder}.csv')

In [12]:
len(df)

157474

In [13]:
df.head()

   Unnamed: 0  u     i     ts  label  idx
0           0  1  8228    0.0    0.0    1
1           1  2  8229   36.0    0.0    2
2           2  2  8229   77.0    0.0    3
3           3  3  8230  131.0    0.0    4
4           4  2  8229  150.0    0.0    5

In [14]:
df = df.drop(['label', 'Unnamed: 0', 'idx'],axis=1)

In [15]:
df.head()

   u     i     ts
0  1  8228    0.0
1  2  8229   36.0
2  2  8229   77.0
3  3  8230  131.0
4  2  8229  150.0

In [16]:
timestamps = df['ts'].unique()

In [19]:
# Create a mapping of original timestamps to new sequential values
timestamp_mapping = {ts: idx for idx, ts in enumerate(sorted(timestamps))}

# Apply the mapping to the 'timestamp' column in degrees_df
df['ts'] = df['ts'].map(timestamp_mapping)

# Display the updated DataFrame
df.head()

   u     i  ts
0  1  8228   0
1  2  8229   1
2  2  8229   2
3  3  8230   3
4  2  8229   4

In [20]:
df.to_pickle(f'./datasets/processed/{folder}/degrees.pickle')

In [37]:
nodes_degrees = []

for ts in timestamps:
    sub_df = df[df['ts'] == ts]
    indegrees = sub_df['i'].value_counts().to_dict()
    outdegrees = sub_df['u'].value_counts().to_dict()
    for node in set(indegrees.keys()).union(outdegrees.keys()):
        nodes_degrees.append({
            'timestamp': ts,
            'node': node,
            'indegree': indegrees.get(node, 0),
            'outdegree': outdegrees.get(node, 0)
        })

# Convert the list of dictionaries to a DataFrame
degrees_df = pd.DataFrame(nodes_degrees)

# Display the DataFrame
degrees_df.head()

   timestamp  node  indegree  outdegree
0        0.0     1         0          1
1        0.0  8228         1          0
2       36.0     2         0          1
3       36.0  8229         1          0
4       77.0     2         0          1

In [38]:
degrees_df

        timestamp  node  indegree  outdegree
0             0.0     1         0          1
1             0.0  8228         1          0
2            36.0     2         0          1
3            36.0  8229         1          0
4            77.0     2         0          1
...           ...   ...       ...        ...
314933  2678293.0  8723         1          0
314934  2678333.0  7480         0          1
314935  2678333.0  9148         1          0
314936  2678373.0  2400         0          1
314937  2678373.0  8723         1          0

[314938 rows x 4 columns]

In [39]:
# Create a mapping of original timestamps to new sequential values
timestamp_mapping = {ts: idx for idx, ts in enumerate(sorted(timestamps))}

# Apply the mapping to the 'timestamp' column in degrees_df
degrees_df['timestamp'] = degrees_df['timestamp'].map(timestamp_mapping)

# Display the updated DataFrame
degrees_df.head()

   timestamp  node  indegree  outdegree
0          0     1         0          1
1          0  8228         1          0
2          1     2         0          1
3          1  8229         1          0
4          2     2         0          1

In [40]:
degrees_df['timestamp'].unique()

array([     0,      1,      2, ..., 152754, 152755, 152756])

In [42]:
# Save the degrees_df DataFrame as a .pickle file
degrees_df.to_pickle('./datasets/processed/Wikipedia/degrees_df.pickle')